InformationRegisters/РазмерыОтчисленийВРезервы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РазмерыОтчисленийВРезервы</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерСоциальногоНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерСоциальныхОтчислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПрофессиональныхПенсионныхВзносов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОтчисленийОСМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПенсионныхВзносовРаботодателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РазмерыОтчисленийВРезервы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		ПроцентСН 	= ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Неопределено, Справочники.НалогиСборыОтчисления.СоциальныйНалог, Запись.Период);
		ПроцентСО	= ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Неопределено, Справочники.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления, Запись.Период);
		ПроцентОПВ	= ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Неопределено, Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы, Запись.Период);
		ПроцентОПВР = ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Неопределено, Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя, Запись.Период);
		ПроцентООСМС= ПроцедурыНалоговогоУчета.ПолучитьСтавкуОСМС(Запись.Период, "Отчисления");
		
		Запись.СчетУчета = ПредопределенноеЗначение("ПланСчетов.Типовой.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам"); // 3430
		
		// по умолчанию процент социального налога и отчислений берем за минусом ОПВ, а СН еще и за минусом соц. отчислений
		Запись.РазмерСоциальногоНалога = (ПроцентСН - ПроцентСО) * (1 - ПроцентОПВ / 100);
		Запись.РазмерСоциальныхОтчислений = ПроцентСО * (1 - ПроцентОПВ / 100);
		Запись.РазмерОтчисленийОСМС = ПроцентООСМС;
		Запись.РазмерПенсионныхВзносовРаботодателя = ПроцентОПВР;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ПроцентСН 	= ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Запись.Организация, Справочники.НалогиСборыОтчисления.СоциальныйНалог, Запись.Период);
	ПроцентСО	= ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Запись.Организация, Справочники.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления, Запись.Период);
	ПроцентОПВ	= ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Запись.Организация, Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы, Запись.Период);
	ПроцентОПВР = ПроцедурыНалоговогоУчета.ПолучитьСтавкуНалога(Запись.Организация, Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя, Запись.Период);
	ПроцентООСМС= ПроцедурыНалоговогоУчета.ПолучитьСтавкуОСМС(Запись.Период, "Отчисления",,Запись.Организация);	
	
	// по умолчанию процент социального налога и отчислений берем за минусом ОПВ, а СН еще и за минусом соц. отчислений
	Запись.РазмерСоциальногоНалога = (ПроцентСН - ПроцентСО) * (1 - ПроцентОПВ / 100);
	Запись.РазмерСоциальныхОтчислений = ПроцентСО * (1 - ПроцентОПВ / 100);
	Запись.РазмерОтчисленийОСМС = ПроцентООСМС;
	Запись.РазмерПенсионныхВзносовРаботодателя = ПроцентОПВР;

КонецПроцедуры
